#Python - Non-technical introduction

##Exercise Day 3 Session 1: "Leverage synergies: How to use “merge” operations?"

This file provides exercises accompanying the lectures.

*Note:* If you want to make changes to this document, you need to save your own copy using the "Save copy in Drive" command in the "File" menu.

###Preparation


1.   Read the csv file and store it in the variable "myData". Note: this file is hostes in a GitHub repository. https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv
2.   Adjust the format of column "TransDate" to datetime
3.  Read the demographics csv file and store it in the variable "CustData". Note: this file is hostes in a GitHub repos. https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/demographics.csv
4.  Adjust the format of column "Birthdate" and “JoinDate” to datetime

In [42]:
#%% Import relevant modules
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [43]:
# Read in data
myData = pd.read_csv(
    "https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/transactions.csv")

In [44]:
myData.head()

   Customer   TransDate  Quantity  PurchAmount    Cost    TransID
0    149332  15.11.2005         1       199.95  107.00  127998739
1    172951  29.08.2008         1       199.95  108.00  128888288
2    120621  19.10.2007         1        99.95   49.00  125375247
3    149236  14.11.2005         1        39.95   18.95  127996226
4    149236  12.06.2007         1        79.95   35.00  128670302

In [45]:
# Read in data
CustData = pd.read_csv(
    "https://raw.githubusercontent.com/bachmannpatrick/Python-Class/master/data/demographics.csv")

In [46]:
CustData.head()

   Customer Gender   Birthdate       ZIP    JoinDate  TransKey
0     42291      m  12.07.1963  US-04533  1998-07-23       NaN
1     42886      f  04.05.1987  US-08055  2011-06-12       NaN
2     80365      f  26.08.1991  US-06332  2009-09-15       NaN
3     84374      m  10.07.1977  US-06400  1988-08-10       NaN
4    200000      m  15.07.1950  US-38016  1969-09-06       NaN

Y and y:

- `Y`: Represents the full year with century(e.g., 2023).
- `y`: Represents the last two digits of the year(e.g., 23 for 2023, 98 for 1998).

m and n:

- `m`: Represents the numeric representation of a month with leading zeros(e.g., 07 for July).
- `n`: Represents the numeric representation of a month without leading zeros(e.g., 7 for July).

d and j:

- `d`: Represents the day of the month with leading zeros(e.g., 07 for the 7th day).
- `j`: Represents the day of the month without leading zeros(e.g., 7 for the 7th day).

In [47]:
us_date_format = "%Y-%m-%d"  # JoinDate, e.g., 1969-09-06
eu_date_format = "%d.%m.%Y"  # TransDate and Birthdate, e.g., 04.05.1987

In [48]:
#fix the Date format
CustData["Birthdate"] = pd.to_datetime(CustData["Birthdate"], format=eu_date_format)
CustData["JoinDate"] = pd.to_datetime(CustData["JoinDate"], format=us_date_format)
myData["TransDate"] = pd.to_datetime(myData["TransDate"], format=eu_date_format)

###23 - Basic merging techniques

No exercises for this unit.

###24 - Inner joins and full outer joins

1. Merge `myData` and `CustData` by Customer using an inner join for customers born after 1980. *Hint:* Check that the date is formatted correctly.

In [49]:
CustData_subset = CustData.loc[CustData["Birthdate"].dt.year > 1980,]
myData.merge(CustData_subset, how="inner", on="Customer")

,Customer,TransDate,Quantity,PurchAmount,Cost,TransID,Gender,Birthdate,ZIP,JoinDate,TransKey
0,149332,2005-11-15,1,199.95,107.00,127998739,m,1998-07-07,US-08873,2005-11-05,100000.0
1,149332,2005-12-13,1,49.95,24.87,129878743,m,1998-07-07,US-08873,2005-11-05,100000.0
2,149332,2006-10-05,1,24.95,12.50,129883508,m,1998-07-07,US-08873,2005-11-05,100000.0
3,105474,2006-12-18,1,49.95,25.00,124452480,m,1987-05-10,US-91741,2005-03-07,100033.0
4,105474,2006-12-18,1,129.95,61.10,124452480,m,1987-05-10,US-91741,2005-03-07,100033.0
...,...,...,...,...,...,...,...,...,...,...,...
85106,199997,2012-09-17,1,29.95,13.80,132481149,m,1997-01-14,US-32092,2012-09-15,323182.0
85107,199997,2012-09-17,1,29.95,13.80,132481149,m,1997-01-14,US-32092,2012-09-15,323182.0
85108,199997,2012-09-17,1,29.95,13.80,132481149,m,1997-01-14,US-32092,2012-09-15,323182.0
85109,199997,2012-09-17,1,29.95,13.80,132481149,m,1997-01-14,US-32092,2012-09-15,323182.0
85110,199997,2012-09-17,1,29.95,13.80,132481149,m,1997-01-14,US-32092,2012-09-15,323182.0

2. Merge `myData` and `CustData` by Customer using an outer join for customers that purchased in 2008.

In [50]:
myData_subset = myData.loc[myData["TransDate"].dt.year == 2008,]

myData.merge(CustData, how="outer", on="Customer").loc[myData.merge(CustData, how="outer", on="Customer")["TransDate"].dt.year == 2008,]

,Customer,TransDate,Quantity,PurchAmount,Cost,TransID,Gender,Birthdate,ZIP,JoinDate,TransKey
3,172951,2008-08-29,1.0,199.95,108.00,128888288.0,m,1963-11-16,US-11378,1980-04-04,100001.0
4,172951,2008-08-29,1.0,249.95,162.50,128888288.0,m,1963-11-16,US-11378,1980-04-04,100001.0
5,172951,2008-08-29,1.0,349.95,187.50,128888288.0,m,1963-11-16,US-11378,1980-04-04,100001.0
26,103952,2008-05-11,1.0,119.95,58.60,128953620.0,m,1977-07-26,US-48060,1993-07-17,100025.0
27,103952,2008-05-11,1.0,24.95,11.50,128953620.0,m,1977-07-26,US-48060,1993-07-17,100025.0
...,...,...,...,...,...,...,...,...,...,...,...
142981,135894,2008-12-31,1.0,24.95,8.00,126304473.0,f,1978-08-21,US-17042,1994-01-29,242981.0
142982,135894,2008-12-31,1.0,24.95,8.00,126304473.0,f,1978-08-21,US-17042,1994-01-29,242981.0
142983,135895,2008-12-31,1.0,39.95,13.95,126304499.0,f,1986-09-12,US-89704,2004-04-16,242983.0
142984,135895,2008-12-31,1.0,39.95,13.95,126304499.0,f,1986-09-12,US-89704,2004-04-16,242983.0
142985,135895,2008-12-31,1.0,39.95,13.95,126304499.0,f,1986-09-12,US-89704,2004-04-16,242983.0

###25 - Left and right outer joins

1. Merge `myData` and `CustData` by `Customer` using an outer left join.

In [51]:
myData.merge(CustData, how="left")

,Customer,TransDate,Quantity,PurchAmount,Cost,TransID,Gender,Birthdate,ZIP,JoinDate,TransKey
0,149332,2005-11-15,1,199.95,107.00,127998739,m,1998-07-07,US-08873,2005-11-05,100000.0
1,172951,2008-08-29,1,199.95,108.00,128888288,m,1963-11-16,US-11378,1980-04-04,100001.0
2,120621,2007-10-19,1,99.95,49.00,125375247,f,1969-08-20,US-63124,1987-01-26,100002.0
3,149236,2005-11-14,1,39.95,18.95,127996226,f,1955-08-15,US-92646,1971-02-16,100003.0
4,149236,2007-06-12,1,79.95,35.00,128670302,f,1955-08-15,US-92646,1971-02-16,100003.0
...,...,...,...,...,...,...,...,...,...,...,...
223186,199997,2012-09-17,1,29.95,13.80,132481149,m,1997-01-14,US-32092,2012-09-15,323182.0
223187,199997,2012-09-17,1,29.95,13.80,132481149,m,1997-01-14,US-32092,2012-09-15,323182.0
223188,199998,2012-09-17,1,29.95,13.80,132481154,f,1956-05-23,US-54952,1975-05-14,323188.0
223189,199999,2012-09-17,1,179.95,109.99,132481165,f,1953-11-06,US-35223,1970-12-23,323189.0
223190,199542,2012-09-17,1,39.95,10.50,131973368,m,1965-03-12,US-02332,1983-07-30,323190.0

2. Merge `myData` and `CustData` by `Customer` using an outer right join.

In [52]:
myData.merge(CustData, how="right")

,Customer,TransDate,Quantity,PurchAmount,Cost,TransID,Gender,Birthdate,ZIP,JoinDate,TransKey
0,42291,NaT,NaN,NaN,NaN,NaN,m,1963-07-12,US-04533,1998-07-23,NaN
1,42886,NaT,NaN,NaN,NaN,NaN,f,1987-05-04,US-08055,2011-06-12,NaN
2,80365,NaT,NaN,NaN,NaN,NaN,f,1991-08-26,US-06332,2009-09-15,NaN
3,84374,NaT,NaN,NaN,NaN,NaN,m,1977-07-10,US-06400,1988-08-10,NaN
4,200000,NaT,NaN,NaN,NaN,NaN,m,1950-07-15,US-38016,1969-09-06,NaN
...,...,...,...,...,...,...,...,...,...,...,...
224190,199997,2012-09-17,1.0,29.95,13.80,132481149.0,m,1997-01-14,US-32092,2012-09-15,323182.0
224191,199997,2012-09-17,1.0,29.95,13.80,132481149.0,m,1997-01-14,US-32092,2012-09-15,323182.0
224192,199998,2012-09-17,1.0,29.95,13.80,132481154.0,f,1956-05-23,US-54952,1975-05-14,323188.0
224193,199999,2012-09-17,1.0,179.95,109.99,132481165.0,f,1953-11-06,US-35223,1970-12-23,323189.0
224194,199542,2012-09-17,1.0,39.95,10.50,131973368.0,m,1965-03-12,US-02332,1983-07-30,323190.0

###26 - Advanced
merging techniques

3. Merge `myData` and `CustData` by `Customer` and by `TransDate` resp. `JoinDate` using an inner join.

In [53]:
myData.merge(CustData, how="inner", left_on=["Customer", "TransDate"], right_on=["Customer", "JoinDate"])

,Customer,TransDate,Quantity,PurchAmount,Cost,TransID,Gender,Birthdate,ZIP,JoinDate,TransKey
0,170823,2008-04-04,2,109.90,45.20,128786894,m,1998-03-21,US-99515,2008-04-04,100214.0
1,103853,2006-06-07,1,159.95,81.11,124416583,f,1990-08-10,US-94114,2006-06-07,101154.0
2,102521,2005-09-14,1,159.95,120.00,124386341,m,1996-07-19,US-94803,2005-09-14,101521.0
3,145017,2005-01-31,1,299.95,215.00,127858059,m,1987-11-14,US-29926,2005-01-31,101804.0
4,145017,2005-01-31,1,0.00,0.00,127858059,m,1987-11-14,US-29926,2005-01-31,101804.0
...,...,...,...,...,...,...,...,...,...,...,...
1010,199292,2012-07-29,1,24.95,13.05,131940739,m,1998-03-06,US-78934,2012-07-29,321752.0
1011,185716,2012-02-08,1,159.95,75.13,129522431,f,1994-10-05,US-46725,2012-02-08,321844.0
1012,199426,2012-01-09,1,39.95,20.00,131960522,f,1997-01-23,US-34238,2012-01-09,322651.0
1013,199426,2012-01-09,1,19.95,9.50,131960522,f,1997-01-23,US-34238,2012-01-09,322651.0
1014,186303,2012-09-13,1,59.95,25.00,129593425,m,1996-12-19,US-60022,2012-09-13,323075.0